### 📋 Terraform Plan: `aws/dfbx/eu-south-2/labs/hands-on-datadog/lambda/lambda-instrumented`

✅ **Plan Status:** Success
⚠️ **Format Check:** Failed (non-blocking)

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m02:00:07.578[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.external.archive_prepare[0]: Reading...
[0;90m02:00:07.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.external.archive_prepare[0]: Read complete after 0s [id=-]
[0;90m02:00:07.654[0m [0;37mSTDOUT[0m [0;36mterraform: [0mlocal_file.archive_plan[0]: Refreshing state... [id=9a1b24c495209cc0955e3ef7f008bee9132f2180]
[0;90m02:00:07.663[0m [0;37mSTDOUT[0m [0;36mterraform: [0mnull_resource.archive[0]: Refreshing state... [id=2769924137558963909]
[0;90m02:00:07.677[0m [0;37mSTDOUT[0m [0;36mterraform: [0mterraform_data.package_filename_for_hash[0]: Refreshing state... [id=f179fca9-de65-4e0b-f472-59b304e6fa79]
[0;90m02:00:08.084[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.additional_inline[0]: Reading...
[0;90m02:00:08.084[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Reading...
[0;90m02:00:08.084[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Reading...
[0;90m02:00:08.084[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Reading...
[0;90m02:00:08.084[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/hands-on-datadog-instrumented-eu-south-2]
[0;90m02:00:08.086[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1425019725]
[0;90m02:00:08.087[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role[0]: Reading...
[0;90m02:00:08.087[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Read complete after 0s [id=eu-south-2]
[0;90m02:00:08.087[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Read complete after 0s [id=aws]
[0;90m02:00:08.088[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
[0;90m02:00:08.088[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy.vpc[0]: Reading...
[0;90m02:00:08.090[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_iam_role.lambda[0]: Refreshing state... [id=hands-on-datadog-instrumented-eu-south-2]
[0;90m02:00:08.207[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Read complete after 0s [id=743199288519]
[0;90m02:00:08.273[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
[0;90m02:00:08.414[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_iam_role_policy.additional_inline[0]: Refreshing state... [id=hands-on-datadog-instrumented-eu-south-2:hands-on-datadog-instrumented-eu-south-2-inline]
[0;90m02:00:08.784[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.logs[0]: Reading...
[0;90m02:00:08.786[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4164397289]
[0;90m02:00:08.787[0m [0;37mSTDOUT[0m [0;36mterraform: [0maws_iam_role_policy.logs[0]: Refreshing state... [id=hands-on-datadog-instrumented-eu-south-2:hands-on-datadog-instrumented-eu-south-2-logs]
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m+/- create replacement and then destroy
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy.vpc[0] will be created
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy" "vpc" {
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "hands-on-datadog-instrumented-eu-south-2-vpc"
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy      = jsonencode(
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action   = [
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:CreateNetworkInterface",
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:DescribeNetworkInterfaces",
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:DeleteNetworkInterface",
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:AssignPrivateIpAddresses",
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:UnassignPrivateIpAddresses",
[0;90m02:00:09.024[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        ]
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect   = "Allow"
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Resource = "*"
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = "hands-on-datadog-instrumented-eu-south-2"
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_lambda_function.this[0] will be created
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_lambda_function" "this" {
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + architectures                  = (known after apply)
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                            = (known after apply)
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + code_sha256                    = (known after apply)
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description                    = "Lambda de laboratorio instrumentada con DataDog Layer"
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + filename                       = "builds/563d409278444530e1eef167a56e354a977b1619e320ba2cb12bcbc70ab26e23.zip"
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + function_name                  = "hands-on-datadog-instrumented-eu-south-2"
[0;90m02:00:09.025[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + handler                        = "datadog_lambda.handler.handler"
[0;90m02:00:09.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                             = (known after apply)
[0;90m02:00:09.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + invoke_arn                     = (known after apply)
[0;90m02:00:09.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + last_modified                  = (known after apply)
[0;90m02:00:09.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + layers                         = [
[0;90m02:00:09.026[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "arn:aws:lambda:eu-south-2:464622532012:layer:Datadog-Python312:97",
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "arn:aws:lambda:eu-south-2:464622532012:layer:Datadog-Extension:59",
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + memory_size                    = 128
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + package_type                   = "Zip"
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + publish                        = false
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + qualified_arn                  = (known after apply)
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + qualified_invoke_arn           = (known after apply)
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                         = "eu-south-2"
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + reserved_concurrent_executions = -1
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + response_streaming_invoke_arn  = (known after apply)
[0;90m02:00:09.029[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role                           = "arn:aws:iam::743199288519:role/hands-on-datadog-instrumented-eu-south-2"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + runtime                        = "python3.12"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + signing_job_arn                = (known after apply)
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + signing_profile_version_arn    = (known after apply)
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy                   = false
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_code_hash               = (known after apply)
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_code_size               = (known after apply)
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                           = {
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                       = {
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m02:00:09.030[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + timeout                        = 3
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + version                        = (known after apply)
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + environment {
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + variables = {
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_API_KEY_SECRET_ARN"     = "arn:aws:ssm:eu-south-2:743199288519:parameter/labs/datadog/DD_API_KEY"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_CAPTURE_LAMBDA_PAYLOAD" = "false"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_ENV"                    = "labs"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_LAMBDA_HANDLER"         = "app.handler"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_SERVICE"                = "dd-lab-lambda"
[0;90m02:00:09.031[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_SITE"                   = "datadoghq.eu"
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_TRACE_ENABLED"          = "true"
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_VERSION"                = "1.0.0"
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ephemeral_storage {
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + size = 512
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + logging_config {
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + log_format = "Text"
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + log_group  = (known after apply)
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tracing_config (known after apply)
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_config {
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + ipv6_allowed_for_dual_stack = false
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + security_group_ids          = [
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "sg-0b054871c2af5cf6f",
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + subnet_ids                  = [
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "subnet-09f4bffc64da623f7",
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "subnet-0ec3e8c57a1cf0762",
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + vpc_id                      = (known after apply)
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # null_resource.archive[0] must be replaced
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m+/- resource "null_resource" "archive" {
[0;90m02:00:09.032[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ id       = "2769924137558963909" -> (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ triggers = { # forces replacement
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          ~ "timestamp" = "1772588571132775000" -> "1772589607640371000"
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged element hidden)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 3 to add, 0 to change, 1 to destroy.
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_arn                                 = (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_code_sha256                         = (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_invoke_arn                          = (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_last_modified                       = (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_qualified_arn                       = (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_qualified_invoke_arn                = (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_signing_job_arn                     = (known after apply)
[0;90m02:00:09.033[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_signing_profile_version_arn         = (known after apply)
[0;90m02:00:09.034[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_source_code_hash                    = (known after apply)
[0;90m02:00:09.034[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_source_code_size                    = (known after apply)
[0;90m02:00:09.034[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_version                             = (known after apply)
[0;90m02:00:09.034[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m02:00:09.034[0m [0;37mSTDOUT[0m [0;36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[0;90m02:00:09.034[0m [0;37mSTDOUT[0m [0;36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

---
*Workflow: [Terragrunt Plan IaC](https://github.com/darthfabax-org/iac/actions/runs/22651630570)*